# MissKeynotingSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeynoteFailures..::..MissKeynotingSystem Property
BuiltInFailures..::..KeynoteFailures Class See Also
---
No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MissKeynotingSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MissKeynotingSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MissKeynotingSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeynoteFailures Class
Autodesk.Revit.DB Namespace